[command]/home/runner/work/_temp/f7e0744e-ba83-4990-aa72-be1f389aea25/terraform-bin plan -no-color
Acquiring state lock. This may take a few moments...
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-default"
        }
      + tags_all               = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-default"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-default"
        }
      + tags_all               = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-default"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-default"
        }
      + tags_all               = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-private-eu-west-1a"
        }
      + tags_all         = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-private-eu-west-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-private-eu-west-1b"
        }
      + tags_all         = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-private-eu-west-1b"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-private-eu-west-1c"
        }
      + tags_all         = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-private-eu-west-1c"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-private-eu-west-1a"
        }
      + tags_all                                       = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-private-eu-west-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-private-eu-west-1b"
        }
      + tags_all                                       = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-private-eu-west-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-private-eu-west-1c"
        }
      + tags_all                                       = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple-private-eu-west-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple"
        }
      + tags_all                             = {
          + "Example"    = "ex-simple"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "ex-simple"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cgw_arns                                    = []
  + cgw_ids                                     = []
  + database_nat_gateway_route_ids              = []
  + database_route_table_association_ids        = []
  + database_route_table_ids                    = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + database_subnet_arns                        = []
  + database_subnets                            = []
  + database_subnets_cidr_blocks                = []
  + database_subnets_ipv6_cidr_blocks           = []
  + default_network_acl_id                      = (known after apply)
  + default_route_table_id                      = (known after apply)
  + default_security_group_id                   = (known after apply)
  + elasticache_route_table_association_ids     = []
  + elasticache_route_table_ids                 = (known after apply)
  + elasticache_subnet_arns                     = []
  + elasticache_subnets                         = []
  + elasticache_subnets_cidr_blocks             = []
  + elasticache_subnets_ipv6_cidr_blocks        = []
  + intra_route_table_association_ids           = []
  + intra_route_table_ids                       = []
  + intra_subnet_arns                           = []
  + intra_subnets                               = []
  + intra_subnets_cidr_blocks                   = []
  + intra_subnets_ipv6_cidr_blocks              = []
  + nat_ids                                     = []
  + nat_public_ips                              = []
  + natgw_ids                                   = []
  + outpost_subnet_arns                         = []
  + outpost_subnets                             = []
  + outpost_subnets_cidr_blocks                 = []
  + outpost_subnets_ipv6_cidr_blocks            = []
  + private_ipv6_egress_route_ids               = []
  + private_nat_gateway_route_ids               = []
  + private_route_table_association_ids         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_route_table_ids                     = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnet_arns                         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets                             = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets_cidr_blocks                 = [
      + "10.0.0.0/20",
      + "10.0.16.0/20",
      + "10.0.32.0/20",
    ]
  + private_subnets_ipv6_cidr_blocks            = []
  + public_route_table_association_ids          = []
  + public_route_table_ids                      = []
  + public_subnet_arns                          = []
  + public_subnets                              = []
  + public_subnets_cidr_blocks                  = []
  + public_subnets_ipv6_cidr_blocks             = []
  + redshift_public_route_table_association_ids = []
  + redshift_route_table_association_ids        = []
  + redshift_route_table_ids                    = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + redshift_subnet_arns                        = []
  + redshift_subnets                            = []
  + redshift_subnets_cidr_blocks                = []
  + redshift_subnets_ipv6_cidr_blocks           = []
  + this_customer_gateway                       = {}
  + vpc_arn                                     = (known after apply)
  + vpc_cidr_block                              = "10.0.0.0/16"
  + vpc_enable_dns_hostnames                    = true
  + vpc_enable_dns_support                      = true
  + vpc_flow_log_cloudwatch_iam_role_arn        = ""
  + vpc_flow_log_destination_arn                = ""
  + vpc_flow_log_destination_type               = "cloud-watch-logs"
  + vpc_id                                      = (known after apply)
  + vpc_instance_tenancy                        = "default"
  + vpc_ipv6_association_id                     = (known after apply)
  + vpc_ipv6_cidr_block                         = (known after apply)
  + vpc_main_route_table_id                     = (known after apply)
  + vpc_owner_id                                = (known after apply)
  + vpc_secondary_cidr_blocks                   = []

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0Adata.aws_availability_zones.available: Reading...%0Adata.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.vpc.aws_default_network_acl.this[0] will be created%0A  + resource "aws_default_network_acl" "this" {%0A      + arn                    = (known after apply)%0A      + default_network_acl_id = (known after apply)%0A      + id                     = (known after apply)%0A      + owner_id               = (known after apply)%0A      + tags                   = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-default"%0A        }%0A      + tags_all               = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-default"%0A        }%0A      + vpc_id                 = (known after apply)%0A%0A      + egress {%0A          + action          = "allow"%0A          + from_port       = 0%0A          + ipv6_cidr_block = "::/0"%0A          + protocol        = "-1"%0A          + rule_no         = 101%0A          + to_port         = 0%0A        }%0A      + egress {%0A          + action     = "allow"%0A          + cidr_block = "0.0.0.0/0"%0A          + from_port  = 0%0A          + protocol   = "-1"%0A          + rule_no    = 100%0A          + to_port    = 0%0A        }%0A%0A      + ingress {%0A          + action          = "allow"%0A          + from_port       = 0%0A          + ipv6_cidr_block = "::/0"%0A          + protocol        = "-1"%0A          + rule_no         = 101%0A          + to_port         = 0%0A        }%0A      + ingress {%0A          + action     = "allow"%0A          + cidr_block = "0.0.0.0/0"%0A          + from_port  = 0%0A          + protocol   = "-1"%0A          + rule_no    = 100%0A          + to_port    = 0%0A        }%0A    }%0A%0A  # module.vpc.aws_default_route_table.default[0] will be created%0A  + resource "aws_default_route_table" "default" {%0A      + arn                    = (known after apply)%0A      + default_route_table_id = (known after apply)%0A      + id                     = (known after apply)%0A      + owner_id               = (known after apply)%0A      + route                  = (known after apply)%0A      + tags                   = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-default"%0A        }%0A      + tags_all               = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-default"%0A        }%0A      + vpc_id                 = (known after apply)%0A%0A      + timeouts {%0A          + create = "5m"%0A          + update = "5m"%0A        }%0A    }%0A%0A  # module.vpc.aws_default_security_group.this[0] will be created%0A  + resource "aws_default_security_group" "this" {%0A      + arn                    = (known after apply)%0A      + description            = (known after apply)%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-default"%0A        }%0A      + tags_all               = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-default"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table.private[0] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-private-eu-west-1a"%0A        }%0A      + tags_all         = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-private-eu-west-1a"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table.private[1] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-private-eu-west-1b"%0A        }%0A      + tags_all         = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-private-eu-west-1b"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table.private[2] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-private-eu-west-1c"%0A        }%0A      + tags_all         = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-private-eu-west-1c"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.private[0] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.private[1] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.private[2] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.private[0] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-west-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.0.0/20"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-private-eu-west-1a"%0A        }%0A      + tags_all                                       = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-private-eu-west-1a"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.private[1] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-west-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.16.0/20"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-private-eu-west-1b"%0A        }%0A      + tags_all                                       = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-private-eu-west-1b"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.private[2] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-west-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.32.0/20"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-private-eu-west-1c"%0A        }%0A      + tags_all                                       = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple-private-eu-west-1c"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_vpc.this[0] will be created%0A  + resource "aws_vpc" "this" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.0.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple"%0A        }%0A      + tags_all                             = {%0A          + "Example"    = "ex-simple"%0A          + "GithubOrg"  = "terraform-aws-modules"%0A          + "GithubRepo" = "terraform-aws-vpc"%0A          + "Name"       = "ex-simple"%0A        }%0A    }%0A%0APlan: 13 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + cgw_arns                                    = []%0A  + cgw_ids                                     = []%0A  + database_nat_gateway_route_ids              = []%0A  + database_route_table_association_ids        = []%0A  + database_route_table_ids                    = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + database_subnet_arns                        = []%0A  + database_subnets                            = []%0A  + database_subnets_cidr_blocks                = []%0A  + database_subnets_ipv6_cidr_blocks           = []%0A  + default_network_acl_id                      = (known after apply)%0A  + default_route_table_id                      = (known after apply)%0A  + default_security_group_id                   = (known after apply)%0A  + elasticache_route_table_association_ids     = []%0A  + elasticache_route_table_ids                 = (known after apply)%0A  + elasticache_subnet_arns                     = []%0A  + elasticache_subnets                         = []%0A  + elasticache_subnets_cidr_blocks             = []%0A  + elasticache_subnets_ipv6_cidr_blocks        = []%0A  + intra_route_table_association_ids           = []%0A  + intra_route_table_ids                       = []%0A  + intra_subnet_arns                           = []%0A  + intra_subnets                               = []%0A  + intra_subnets_cidr_blocks                   = []%0A  + intra_subnets_ipv6_cidr_blocks              = []%0A  + nat_ids                                     = []%0A  + nat_public_ips                              = []%0A  + natgw_ids                                   = []%0A  + outpost_subnet_arns                         = []%0A  + outpost_subnets                             = []%0A  + outpost_subnets_cidr_blocks                 = []%0A  + outpost_subnets_ipv6_cidr_blocks            = []%0A  + private_ipv6_egress_route_ids               = []%0A  + private_nat_gateway_route_ids               = []%0A  + private_route_table_association_ids         = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + private_route_table_ids                     = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + private_subnet_arns                         = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + private_subnets                             = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + private_subnets_cidr_blocks                 = [%0A      + "10.0.0.0/20",%0A      + "10.0.16.0/20",%0A      + "10.0.32.0/20",%0A    ]%0A  + private_subnets_ipv6_cidr_blocks            = []%0A  + public_route_table_association_ids          = []%0A  + public_route_table_ids                      = []%0A  + public_subnet_arns                          = []%0A  + public_subnets                              = []%0A  + public_subnets_cidr_blocks                  = []%0A  + public_subnets_ipv6_cidr_blocks             = []%0A  + redshift_public_route_table_association_ids = []%0A  + redshift_route_table_association_ids        = []%0A  + redshift_route_table_ids                    = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + redshift_subnet_arns                        = []%0A  + redshift_subnets                            = []%0A  + redshift_subnets_cidr_blocks                = []%0A  + redshift_subnets_ipv6_cidr_blocks           = []%0A  + this_customer_gateway                       = {}%0A  + vpc_arn                                     = (known after apply)%0A  + vpc_cidr_block                              = "10.0.0.0/16"%0A  + vpc_enable_dns_hostnames                    = true%0A  + vpc_enable_dns_support                      = true%0A  + vpc_flow_log_cloudwatch_iam_role_arn        = ""%0A  + vpc_flow_log_destination_arn                = ""%0A  + vpc_flow_log_destination_type               = "cloud-watch-logs"%0A  + vpc_id                                      = (known after apply)%0A  + vpc_instance_tenancy                        = "default"%0A  + vpc_ipv6_association_id                     = (known after apply)%0A  + vpc_ipv6_cidr_block                         = (known after apply)%0A  + vpc_main_route_table_id                     = (known after apply)%0A  + vpc_owner_id                                = (known after apply)%0A  + vpc_secondary_cidr_blocks                   = []%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0